#include <iostream>
#include <cmath>

using namespace std;

double func (double a, double b){
    return pow(a, b)+34-sqrt(a)-pow(5, b);
}

/**
* @brief функция какая то сложная
* @details ## ВАЖНАЯ ФУНКЦИЯ <b>вау жирный текст</b> вроде MD поддерживает
* @param a первое число
* @param b второе число
* @returns возвращает 0 и заканчивает код
* @warning Код вообще новичковый и точно не подойдет для использования в качестве какой то хрени прикольной, только для ознакомления
* @todo улучшить в принципе тут нужно все, мне не нравиться что он пустой. Вот бы код на 10000 строк...
* @example примера нет бро
* @version версия 0.01 beta
* @author insti2t
*/
int func1(){
    int a = 4;
    int b = 2;
    cout << "func ??: " << func(a,b) << "\n" << endl;
    return 0;
}

/**
 * @brief функция сложения
 * @details ## ВАЖНАЯ ФУНКЦИЯ <b>вау жирный текст</b> вроде MD поддерживает
 * @param a первое число
 * @param b второе число
 * @returns возвращает 0 и заканчивает код
 * @warning Код вообще новичковый и точно не подойдет для использования в качестве какой то хрени прикольной, только для ознакомления
 * @todo улучшить в принципе тут нужно все, мне не нравиться что он пустой. Вот бы код на 10000 строк...
 * @example примера нет бро
 * @version версия 0.01 beta
 * @author insti2t
 */
int sum(){
    int a = 4;
    int b = 2;
    cout << "sum a and b: " << a+b << "\n" << endl;
    return 0;
}

/**
 * @brief функция деления
 * @details ## ВАЖНАЯ ФУНКЦИЯ <b>вау жирный текст</b> вроде MD поддерживает
 * @param a первое число
 * @param b второе число
 * @returns возвращает 0 и заканчивает код
 * @warning Код вообще новичковый и точно не подойдет для использования в качестве какой то хрени прикольной, только для ознакомления
 * @todo улучшить в принципе тут нужно все, мне не нравиться что он пустой. Вот бы код на 10000 строк...
 * @example примера нет бро
 * @version версия 0.01 beta
 * @author insti2t
 */
int division(){
    int a = 4;
    int b = 2;
    cout << "division a and b: " << a/b << "\n" << endl;
    return 0;
}

/**
 * @brief функция умножения
 * @details ## ВАЖНАЯ ФУНКЦИЯ <b>вау жирный текст</b> вроде MD поддерживает
 * @param a первое число
 * @param b второе число
 * @returns возвращает 0 и заканчивает код
 * @warning Код вообще новичковый и точно не подойдет для использования в качестве какой то хрени прикольной, только для ознакомления
 * @todo улучшить в принципе тут нужно все, мне не нравиться что он пустой. Вот бы код на 10000 строк...
 * @example примера нет бро
 * @version версия 0.01 beta
 * @author insti2t
 */
int multy(){
    int a = 4;
    int b = 2;
    cout << "multy a and b: " << a*b << "\n" << endl;
    return 0;
}

/**
 * @brief главная функция, которая вызывает остальные в консоль
 * @details ## ВАЖНАЯ ФУНКЦИЯ <b>вау жирный текст</b> вроде MD поддерживает
 * @param a первое число
 * @param b второе число
 * @returns возвращает 0 и заканчивает код
 * @warning Код вообще новичковый и точно не подойдет для использования в качестве какой то хрени прикольной, только для ознакомления
 * @todo улучшить в принципе тут нужно все, мне не нравиться что он пустой. Вот бы код на 10000 строк...
 * @example примера нет бро
 * @version версия 0.01 beta
 * @author insti2t
 */
int main(){
    int a = 4;
    int b = 2;

    func1();
    sum();
    division();
    multy();

    return 0;
}